validation/polydisperseBubbleFoam/shockTube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters .01;

w       10;
h       100;
depth   10;

nPtsWide    1;
nPtsHigh    4000;
nDepthPts   1;

vertices
(
    (   0       0       0       )   //0
    (   $w      0       0       )   //1
    (   $w      $h      0       )   //2
    (   0       $h      0       )   //3
    (   0       0       $depth  )   //4
    (   $w      0       $depth  )   //5
    (   $w      $h      $depth  )   //6
    (   0       $h      $depth  )   //7


);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    ($nPtsWide $nPtsHigh $nDepthPts)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type            patch;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type            patch;
        faces
        (
            (2 3 7 6)
        );
    }
//     leftRight
//     {
//         type            patch;
//         faces
//         (
//             (0 3 7 4)
//             (1 2 6 5)
//         );
//     }
);

mergePatchPairs
(
);

// ************************************************************************* //
