validation/polydisperseBubbleFoam/shockTube/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// momentumSource
// {
// 	type            phaseIncompressibleMeanVelocityForce;
//     active          true;            //on/off switch
//
//     selectionMode   all;
//     fieldNames      (U.water);
//     alphaName       alpha.water;
//     rhoName         thermo:rho.water;
//     Ubar		    (0 1e-6 0);
// }


// ************************************************************************* //
