validation/polydisperseBubbleFoam/shockTube/system/momentGenerationDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      momentGenerationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    air
);

boundaries
{
    bottom
    {
        type    fixedValue;
        value   uniform 0.0;
    }
    top
    {
        type    zeroGradient;
    }
    leftRight
    {
        type    zeroGradient;
    }
    defaultFaces
    {
        type    empty;
    }
}

air
{
    type                alphaAndDiameter;
    weightDimension     [0 -3 0 0 0 0 0];
    abscissaDimension   [1 0 0 0 0 0 0];

    internal
    {
        node0
        {
            rho     1.40;
            dia     8.0e-3;
            alpha   0.033;
        }
        node1
        {
            rho     1.40;
            dia     9.0e-3;
            alpha   0.034;
        }
        node2
        {
            rho     1.40;
            dia     10.0e-3;
            alpha   0.033;
        }
    }
    bottom
    {
        node0
        {
            rho     1.40;
            dia     8.0e-3;
            alpha   0.033;
        }
        node1
        {
            rho     1.40;
            dia     9.0e-3;
            alpha   0.034;
        }
        node2
        {
            rho     1.40;
            dia     10.0e-3;
            alpha   0.033;
        }
    }
}


// ************************************************************************* //
